Revit 2027 API
ParameterTypeId.LegendComponent Property
 "Component Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LegendComponent { get; }
Public Shared ReadOnly Property LegendComponent As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LegendComponent {
	ForgeTypeId^ get ();
}
static member LegendComponent : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace